[
  {
    "id": 1,
    "user":"student",
    "category":"Data Science",
    "title": "Femtech Innovation Hackathon",
    "status":"Live",
    "EventType":"online",
    "TeamSize":"2",
    "payment":"paid",
    "tagline":"Artificial inteeligence",
    "image":"/femtech1.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$5,000 + Incubation Support",
    "startDate":"2025-09-11",
    "endDate":"2025-09-16",
    "registrationCloses": "2025-09-10",
    "submissionDeadline": "2025-09-15",
    "overview":"HackHERHealth is a hybrid (both in-person and virtual) innovation hackathon aimed at closing the gender health gap by developing gender-specific health solutions. Participants worldwide—from students to professionals—are invited to collaborate across disciplines and leverage cutting-edge technologies, including AI, to tackle real-world challenges in women's health.",
    "date":"2025-09-12",
    "registrationUrl":"/login",
    "howit":["Hybrid Format: Participants can join online or in-person.","Multidisciplinary Approach: Teams are encouraged to combine technical, clinical, policy, and creative strengths.","AI as a Partner: Generative AI tools are leveraged both for ideation and development"],
    "about": [
      {
        "title": "What!",
        "description": "HackHERHealth is a hybrid (both in-person and virtual) innovation hackathon aimed at closing the gender health gap by developing gender-specific health solutions. Participants worldwide—from students to professionals—are invited to collaborate across disciplines and leverage cutting-edge technologies, including AI, to tackle real-world challenges in women's health.",
        "icon": "/why.jpeg"
      },
      {
        "title": "Why!",
        "description": "Women have historically been underrepresented in clinical trials, often making up just 29–34% of participants. This underrepresentation contributes to a systemic bias in medical research, leading to increased health risks for women. HackHERHealth is designed to confront and correct these disparities.",
        "icon": "/why.jpeg"
      },
      {
        "title": "How!",
        "description": "HackHERHealth leverages AI and diverse expertise to tackle key challenges in closing the gender health gap.",
        "icon": "/why.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Students",
        "description": "In the Femtech Innovation Hackathon (HackHERHealth), participation is open to students from a wide range of academic backgrounds, not just those in technology or medicine. Any student who is currently enrolled in a recognized high school, college, or university can join, whether they are studying engineering, computer science, healthcare, life sciences, design, business, or even the social sciences. Both undergraduate and postgraduate students are welcome, and many events also allow recent graduates to participate.",
        "icon": "/ai.jpeg"
      },
      {
        "title": "Professionals",
        "description": "The Femtech Innovation Hackathon (HackHERHealth) welcomes professionals from a variety of fields, creating a truly multidisciplinary environment. Healthcare professionals such as doctors, nurses, midwives, therapists, and public health specialists can join to provide clinical insight and real-world unders.",
        "icon": "/ai.jpeg"
      },
      {
        "title": "Innovators",
        "description": "The Femtech Innovation Hackathon (HackHERHealth) is open to innovators from all walks of life who are passionate about creating impactful solutions for women’s health. This includes entrepreneurs with bold new ideas for products or services, inventors developing novel medical devices or wearable technologies, and creative thinkers exploring unconventional approaches to healthcare challenges. ",
        "icon": "/ai.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Improving Women's Journey in Obesity",
        "description": "The hackathon welcomes a diverse range of participants—from clinicians, healthcare providers, and researchers to technologists, students, and policy experts. No coding experience is required: whether you bring a bold idea, a specialized skill, or none at all, you're encouraged to join.",
        "icon": "/ai.jpeg"
      },
      {
        "title": "Advancing Accessibility & Precision of Diagnosis for Neurodivergent Girls",
        "description": "Tackle overlooked symptoms and gender diagnostic bias in ASD & ADHD.",
        "icon": "/ai.jpeg"
      },
      {
        "title": "Rethinking and Innovating Pregnancy and Postpartum Care in Sweden",
        "description": "Overcome care fragmentation and language barriers for postpartum women.",
        "icon": "/ai.jpeg"
      }
    ]
  },
    {
    "id": 2,
    "user": "student",
    "category": "Blockchain",
    "title": "CryptoFuture Web3 Hackathon",
    "status": "Live",
    "EventType": "hybrid",
    "TeamSize": "3",
    "payment": "paid",
    "tagline": "Decentralized Tomorrow",
    "image": "/crypto.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$10,000 + Token Rewards",
    "startDate": "2025-09-20",
    "endDate": "2025-09-25",
    "registrationCloses": "2025-09-19",
    "submissionDeadline": "2025-09-24",
    "overview": "CryptoFuture is a cutting-edge Web3 hackathon focused on building decentralized applications that solve real-world problems. Participants will explore blockchain technology, smart contracts, and DeFi solutions while competing for substantial prizes and mentorship opportunities.",
    "date": "2025-09-22",
    "registrationUrl": "/login",
    "howit": ["Hybrid participation with global mentors", "Focus on practical DeFi and NFT solutions", "Integration with major blockchain networks"],
    "about": [
      {
        "title": "What!",
        "description": "A comprehensive Web3 hackathon bringing together developers, designers, and blockchain enthusiasts to create the next generation of decentralized applications and financial solutions.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "Why!",
        "description": "The blockchain ecosystem needs practical, user-friendly applications that can bridge the gap between traditional finance and decentralized systems, making Web3 accessible to mainstream users.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "How!",
        "description": "Through collaborative development, expert mentorship, and access to cutting-edge blockchain tools and infrastructure.",
        "icon": "/blockchain.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Developers",
        "description": "Blockchain developers, full-stack engineers, smart contract specialists, and anyone with programming experience interested in decentralized technologies and Web3 development.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "Designers",
        "description": "UX/UI designers passionate about creating intuitive interfaces for complex blockchain applications, making Web3 more accessible and user-friendly.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "Entrepreneurs",
        "description": "Business innovators and startup founders looking to explore blockchain-based business models and create sustainable decentralized solutions.",
        "icon": "/blockchain.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "DeFi for Everyone",
        "description": "Create user-friendly decentralized finance applications that make complex financial instruments accessible to non-technical users.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "Sustainable NFT Marketplace",
        "description": "Build an eco-friendly NFT platform that addresses environmental concerns while supporting digital artists and creators.",
        "icon": "/blockchain.jpeg"
      },
      {
        "title": "Cross-Chain Identity Management",
        "description": "Develop solutions for seamless identity verification and data portability across different blockchain networks.",
        "icon": "/blockchain.jpeg"
      }
    ]
  },
  {
    "id": 3,
    "user": "professional",
    "category": "Climate Tech",
    "title": "Green Innovation Challenge",
    "status": "Upcoming",
    "EventType": "online",
    "TeamSize": "4",
    "payment": "free",
    "tagline": "Climate Solutions for Tomorrow",
    "image": "/green.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$15,000 + Accelerator Program",
    "startDate": "2025-10-01",
    "endDate": "2025-10-06",
    "registrationCloses": "2025-09-28",
    "submissionDeadline": "2025-10-05",
    "overview": "The Green Innovation Challenge brings together climate-conscious innovators to develop technology solutions for environmental sustainability, carbon reduction, and renewable energy adoption.",
    "date": "2025-10-03",
    "registrationUrl": "/login",
    "howit": ["Focus on scalable climate solutions", "Partnership with environmental organizations", "Access to climate data and APIs"],
    "about": [
      {
        "title": "What!",
        "description": "A global hackathon dedicated to creating innovative technology solutions that address climate change, promote sustainability, and accelerate the transition to a green economy.",
        "icon": "/why.jpeg"
      },
      {
        "title": "Why!",
        "description": "Climate change represents one of humanity's greatest challenges, requiring immediate, innovative technological solutions to reduce emissions and adapt to environmental changes.",
        "icon": "/climate.jpeg"
      },
      {
        "title": "How!",
        "description": "By combining cutting-edge technology with environmental science and sustainable business models to create impactful climate solutions.",
        "icon": "/climate.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Environmental Scientists",
        "description": "Researchers and professionals in environmental science, climate studies, renewable energy, and sustainability looking to translate knowledge into practical solutions.",
        "icon": "/climate.jpeg"
      },
      {
        "title": "Tech Innovators",
        "description": "Software developers, IoT specialists, and data scientists interested in applying technology to solve environmental challenges and create sustainable solutions.",
        "icon": "/climate.jpeg"
      },
      {
        "title": "Policy Experts",
        "description": "Environmental policy makers, sustainability consultants, and green business strategists focused on systemic change and scalable climate solutions.",
        "icon": "/climate.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Carbon Footprint Tracker",
        "description": "Develop AI-powered tools to help individuals and businesses accurately measure and reduce their carbon footprint through actionable insights.",
        "icon": "/climate.jpeg"
      },
      {
        "title": "Smart Energy Grid Optimization",
        "description": "Create solutions for optimizing renewable energy distribution and storage in smart grid systems for maximum efficiency.",
        "icon": "/climate.jpeg"
      },
      {
        "title": "Circular Economy Platform",
        "description": "Build platforms that facilitate waste reduction, resource reuse, and circular business models in various industries.",
        "icon": "/climate.jpeg"
      }
    ]
  },
  {
    "id": 4,
    "user": "student",
    "category": "EdTech",
    "title": "Learn Tomorrow Hackathon",
    "status": "Live",
    "EventType": "online",
    "TeamSize": "3",
    "payment": "free",
    "tagline": "Revolutionizing Education",
    "image": "/learn.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$8,000 + Mentorship Program",
    "startDate": "2025-09-15",
    "endDate": "2025-09-20",
    "registrationCloses": "2025-09-14",
    "submissionDeadline": "2025-09-19",
    "overview": "Learn Tomorrow focuses on creating innovative educational technologies that make learning more accessible, engaging, and effective for students of all ages and backgrounds.",
    "date": "2025-09-17",
    "registrationUrl": "/login",
    "howit": ["Student-centered design approach", "Integration with learning management systems", "Focus on accessibility and inclusion"],
    "about": [
      {
        "title": "What!",
        "description": "An educational technology hackathon aimed at developing innovative digital learning solutions that enhance student engagement and improve educational outcomes.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "Why!",
        "description": "Traditional education systems face challenges in adapting to diverse learning styles and modern technological capabilities, creating opportunities for innovative EdTech solutions.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "How!",
        "description": "Through user-centered design, educational research integration, and cutting-edge technology to create personalized and engaging learning experiences.",
        "icon": "/edtech.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Students",
        "description": "Students from education, computer science, psychology, and design backgrounds who understand learning challenges and want to create solutions for their peers.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "Educators",
        "description": "Teachers, professors, instructional designers, and education professionals who can provide insights into real classroom needs and learning challenges.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "Developers",
        "description": "Software developers, UX designers, and technologists interested in applying their skills to create meaningful educational technology solutions.",
        "icon": "/edtech.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Personalized Learning Paths",
        "description": "Create AI-driven systems that adapt to individual learning styles and pace, providing customized educational content and assessments.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "Virtual Reality Classrooms",
        "description": "Develop immersive VR learning environments that make complex subjects more engaging and accessible through interactive experiences.",
        "icon": "/edtech.jpeg"
      },
      {
        "title": "Accessibility in Education",
        "description": "Build tools that make educational content accessible to students with disabilities, ensuring inclusive learning for all.",
        "icon": "/edtech.jpeg"
      }
    ]
  },
  {
    "id": 5,
    "user": "professional",
    "category": "FinTech",
    "title": "Digital Finance Revolution",
    "status": "Upcoming",
    "EventType": "hybrid",
    "TeamSize": "4",
    "payment": "paid",
    "tagline": "Banking Reimagined",
    "image": "/digital.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$20,000 + Investor Pitch",
    "startDate": "2025-10-10",
    "endDate": "2025-10-15",
    "registrationCloses": "2025-10-08",
    "submissionDeadline": "2025-10-14",
    "overview": "Digital Finance Revolution challenges participants to reimagine traditional banking and financial services through innovative technology solutions that prioritize user experience and financial inclusion.",
    "date": "2025-10-12",
    "registrationUrl": "/login",
    "howit": ["Industry mentor network", "Real-world banking APIs", "Focus on regulatory compliance"],
    "about": [
      {
        "title": "What!",
        "description": "A comprehensive FinTech hackathon focused on developing next-generation financial services and banking solutions that leverage emerging technologies.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "Why!",
        "description": "The financial services industry is undergoing rapid digital transformation, creating opportunities for innovative solutions that improve accessibility and user experience.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "How!",
        "description": "Through collaboration with financial institutions, access to banking APIs, and expert guidance on regulatory requirements and market needs.",
        "icon": "/fintech.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Developers",
        "description": "Software engineers, mobile app developers, and backend specialists with experience in secure financial systems and payment processing technologies.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "Financial Professionals",
        "description": "Banking professionals, financial analysts, and compliance experts who understand industry regulations and real-world financial challenges.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "UX Designers",
        "description": "User experience designers specializing in creating intuitive and secure interfaces for complex financial applications and services.",
        "icon": "/fintech.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Micro-Investment Platform",
        "description": "Create accessible investment platforms that help users with limited capital start building wealth through automated micro-investing.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "AI-Powered Financial Advisory",
        "description": "Develop intelligent financial advisory systems that provide personalized investment and budgeting recommendations.",
        "icon": "/fintech.jpeg"
      },
      {
        "title": "Cross-Border Payment Solutions",
        "description": "Build efficient and affordable international payment systems that reduce fees and processing times for global transactions.",
        "icon": "/fintech.jpeg"
      }
    ]
  },
  {
    "id": 6,
    "user": "student",
    "category": "Gaming",
    "title": "Indie Game Jam Fest",
    "status": "Live",
    "EventType": "online",
    "TeamSize": "5",
    "payment": "free",
    "tagline": "Play Create Innovate",
    "image": "/indiegame.png",
    "bgimage": "/hack1.jpeg",
    "prize": "$12,000 + Publishing Deal",
    "startDate": "2025-09-18",
    "endDate": "2025-09-23",
    "registrationCloses": "2025-09-17",
    "submissionDeadline": "2025-09-22",
    "overview": "Indie Game Jam Fest brings together creative minds to develop innovative games that push boundaries in storytelling, mechanics, and player engagement while fostering the indie game development community.",
    "date": "2025-09-20",
    "registrationUrl": "/login",
    "howit": ["48-hour intensive development", "Industry expert judging panel", "Focus on creative innovation over graphics"],
    "about": [
      {
        "title": "What!",
        "description": "An intensive game development competition where teams create original games from concept to playable prototype, emphasizing creativity and innovation.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "Why!",
        "description": "The indie game industry thrives on fresh ideas and innovative gameplay mechanics that challenge traditional gaming conventions and create unique player experiences.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "How!",
        "description": "Through rapid prototyping, creative collaboration, and access to game development tools and resources from industry partners.",
        "icon": "/gaming.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Game Developers",
        "description": "Programmers experienced in game engines like Unity, Unreal Engine, or custom frameworks, ready to bring creative game concepts to life.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "Artists & Designers",
        "description": "2D/3D artists, animators, and game designers who can create compelling visuals and engaging gameplay experiences.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "Sound Designers",
        "description": "Audio professionals and music composers who can create immersive soundscapes and memorable game audio experiences.",
        "icon": "/gaming.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Climate Change Awareness Game",
        "description": "Create engaging games that educate players about environmental issues while providing entertaining gameplay experiences.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "Accessibility-First Gaming",
        "description": "Develop games specifically designed for players with disabilities, ensuring inclusive gaming experiences for all.",
        "icon": "/gaming.jpeg"
      },
      {
        "title": "Experimental Gameplay Mechanics",
        "description": "Push the boundaries of traditional game design with innovative mechanics that create entirely new types of player experiences.",
        "icon": "/gaming.jpeg"
      }
    ]
  },
  {
    "id": 7,
    "user": "professional",
    "category": "IoT",
    "title": "Smart City Solutions Hack",
    "status": "Upcoming",
    "EventType": "hybrid",
    "TeamSize": "4",
    "payment": "paid",
    "tagline": "Connected Urban Future",
    "image": "/iot.jpeg",
    "bgimage": "/hack7.jpeg",
    "prize": "$18,000 + Pilot Program",
    "startDate": "2025-10-20",
    "endDate": "2025-10-25",
    "registrationCloses": "2025-10-18",
    "submissionDeadline": "2025-10-24",
    "overview": "Smart City Solutions Hack focuses on developing IoT-based solutions that improve urban living through connected devices, data analytics, and intelligent systems for transportation, energy, and public services.",
    "date": "2025-10-22",
    "registrationUrl": "/login",
    "howit": ["Real city data access", "IoT hardware provided", "Municipal government partnerships"],
    "about": [
      {
        "title": "What!",
        "description": "An IoT-focused hackathon aimed at creating smart city solutions that improve urban infrastructure, sustainability, and quality of life for city residents.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "Why!",
        "description": "Rapid urbanization creates challenges in traffic management, energy efficiency, and public services that can be addressed through intelligent IoT solutions.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "How!",
        "description": "By leveraging sensor networks, data analytics, and connected devices to create intelligent urban systems that respond to real-time needs.",
        "icon": "/iot.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "IoT Engineers",
        "description": "Hardware and software engineers specializing in Internet of Things technologies, sensor networks, and embedded systems development.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "Urban Planners",
        "description": "City planning professionals and public policy experts who understand urban challenges and can design practical smart city solutions.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "Data Scientists",
        "description": "Analytics professionals who can process and interpret large datasets from urban sensors to create actionable insights for city management.",
        "icon": "/iot.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Smart Traffic Management",
        "description": "Develop IoT systems that optimize traffic flow, reduce congestion, and improve public transportation efficiency in urban areas.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "Environmental Monitoring Network",
        "description": "Create sensor networks that monitor air quality, noise levels, and environmental conditions to improve urban sustainability.",
        "icon": "/iot.jpeg"
      },
      {
        "title": "Smart Waste Management",
        "description": "Build intelligent waste collection and recycling systems that optimize routes and reduce environmental impact.",
        "icon": "/iot.jpeg"
      }
    ]
  },
  {
    "id": 8,
    "user": "faculty",
    "category": "Cybersecurity",
    "title": "SecureNet Defense Challenge",
    "status": "Live",
    "EventType": "online",
    "TeamSize": "3",
    "payment": "free",
    "tagline": "Defending Digital Frontiers",
    "image": "/security.jpeg",
    "bgimage": "/hack8.jpeg",
    "prize": "$7,500 + Security Certification",
    "startDate": "2025-09-25",
    "endDate": "2025-09-30",
    "registrationCloses": "2025-09-24",
    "submissionDeadline": "2025-09-29",
    "overview": "SecureNet Defense Challenge focuses on developing innovative cybersecurity solutions to protect against emerging threats, with emphasis on AI-driven security and privacy-preserving technologies.",
    "date": "2025-09-27",
    "registrationUrl": "/login",
    "howit": ["Capture the Flag competitions", "Real threat scenario simulations", "Industry security expert mentorship"],
    "about": [
      {
        "title": "What!",
        "description": "A cybersecurity-focused hackathon where participants develop tools and systems to defend against modern cyber threats and protect digital privacy.",
        "icon": "/security.jpeg"
      },
      {
        "title": "Why!",
        "description": "The increasing sophistication of cyber attacks requires innovative security solutions that can adapt to evolving threats and protect critical infrastructure.",
        "icon": "/security.jpeg"
      },
      {
        "title": "How!",
        "description": "Through hands-on security challenges, threat modeling exercises, and development of practical cybersecurity tools and systems.",
        "icon": "/security.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Security Engineers",
        "description": "Cybersecurity professionals, ethical hackers, and security researchers with experience in threat detection and defense systems.",
        "icon": "/security.jpeg"
      },
      {
        "title": "Computer Science Students",
        "description": "Students studying cybersecurity, computer science, or related fields interested in learning about modern security challenges and solutions.",
        "icon": "/security.jpeg"
      },
      {
        "title": "Network Specialists",
        "description": "Network administrators and infrastructure specialists focused on securing communication systems and preventing cyber attacks.",
        "icon": "/security.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "AI-Powered Threat Detection",
        "description": "Develop machine learning systems that can identify and respond to sophisticated cyber attacks in real-time.",
        "icon": "/security.jpeg"
      },
      {
        "title": "Zero-Trust Network Architecture",
        "description": "Create security frameworks that assume no implicit trust and verify every transaction within a network system.",
        "icon": "/security.jpeg"
      },
      {
        "title": "Privacy-Preserving Analytics",
        "description": "Build systems that enable data analysis while maintaining user privacy through advanced encryption and anonymization techniques.",
        "icon": "/security.jpeg"
      }
    ]
  },
  {
    "id": 9,
    "user": "professional",
    "category": "AR/VR",
    "title": "Immersive Reality Expo",
    "status": "Upcoming",
    "EventType": "hybrid",
    "TeamSize": "4",
    "payment": "paid",
    "tagline": "Beyond Reality",
    "image": "/arvr.jpeg",
    "bgimage": "/hack9.jpeg",
    "prize": "$25,000 + VR Studio Partnership",
    "startDate": "2025-11-01",
    "endDate": "2025-11-06",
    "registrationCloses": "2025-10-30",
    "submissionDeadline": "2025-11-05",
    "overview": "Immersive Reality Expo challenges participants to create groundbreaking AR/VR applications that transform how we work, learn, and interact with digital environments across various industries.",
    "date": "2025-11-03",
    "registrationUrl": "/login",
    "howit": ["Latest VR/AR hardware access", "Industry partnership opportunities", "Focus on practical applications"],
    "about": [
      {
        "title": "What!",
        "description": "An immersive technology hackathon focused on developing practical AR/VR applications that solve real-world problems across healthcare, education, and enterprise.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "Why!",
        "description": "AR/VR technologies are reaching maturity and creating opportunities for transformative applications in training, visualization, and human-computer interaction.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "How!",
        "description": "Through access to cutting-edge hardware, expert mentorship, and partnerships with companies implementing AR/VR solutions in their operations.",
        "icon": "/arvr.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "VR Developers",
        "description": "Software developers experienced in Unity, Unreal Engine, or specialized VR/AR development frameworks and 3D programming.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "3D Artists",
        "description": "3D modelers, animators, and digital artists who can create immersive visual experiences and realistic virtual environments.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "UX Researchers",
        "description": "User experience professionals specializing in spatial design and human factors for immersive technology interfaces.",
        "icon": "/arvr.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Medical Training Simulator",
        "description": "Create VR training systems for medical professionals to practice procedures in safe, controlled virtual environments.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "Remote Collaboration Platform",
        "description": "Develop AR/VR solutions that enable effective remote teamwork and collaboration in virtual spaces.",
        "icon": "/arvr.jpeg"
      },
      {
        "title": "Accessibility in VR",
        "description": "Build VR applications designed specifically for users with physical disabilities, creating inclusive immersive experiences.",
        "icon": "/arvr.jpeg"
      }
    ]
  },
  {
    "id": 10,
    "user": "student",
    "category": "Social Impact",
    "title": "Code for Good Initiative",
    "status": "Live",
    "EventType": "online",
    "TeamSize": "4",
    "payment": "free",
    "tagline": "Technology for Humanity",
    "image": "/social.jpeg",
    "bgimage": "/hack10.jpeg",
    "prize": "$6,000 + NGO Partnership",
    "startDate": "2025-09-28",
    "endDate": "2025-10-03",
    "registrationCloses": "2025-09-27",
    "submissionDeadline": "2025-10-02",
    "overview": "Code for Good Initiative brings together socially conscious developers to create technology solutions that address pressing social issues and support non-profit organizations in their missions.",
    "date": "2025-09-30",
    "registrationUrl": "/login",
    "howit": ["Partnership with local NGOs", "Focus on scalable social solutions", "Community impact measurement"],
    "about": [
      {
        "title": "What!",
        "description": "A social impact hackathon where participants develop technology solutions that address social challenges and support community organizations in their work.",
        "icon": "/social.jpeg"
      },
      {
        "title": "Why!",
        "description": "Many social problems can be alleviated through thoughtful application of technology, but non-profits often lack resources to develop custom solutions.",
        "icon": "/social.jpeg"
      },
      {
        "title": "How!",
        "description": "By connecting developers with social organizations and focusing on creating sustainable, impactful technology solutions for community needs.",
        "icon": "/social.jpeg"
      }
    ],
    "whoCanParticipate": [
      {
        "title": "Student Developers",
        "description": "Computer science and engineering students passionate about using their technical skills to create positive social impact in their communities.",
        "icon": "/social.jpeg"
      },
      {
        "title": "Social Workers",
        "description": "Non-profit professionals, social workers, and community organizers who understand social challenges and can guide technology solutions.",
        "icon": "/social.jpeg"
      },
      {
        "title": "Design Students",
        "description": "Design students interested in human-centered design and creating accessible, user-friendly interfaces for diverse populations.",
        "icon": "/social.jpeg"
      }
    ],
    "challenges": [
      {
        "title": "Homelessness Support Platform",
        "description": "Create digital tools that help homeless individuals access services, resources, and support networks in their communities.",
        "icon": "/social.jpeg"
      },
      {
        "title": "Educational Resource Sharing",
        "description": "Develop platforms that enable sharing of educational materials and tutoring services in underserved communities.",
        "icon": "/social.jpeg"
      },
      {
        "title": "Mental Health Support Network",
        "description": "Build accessible digital platforms that provide mental health resources and peer support for vulnerable populations.",
        "icon": "/social.jpeg"
      }
    ]
  }
]

 