[
  {
    "id": 1,
    "logo": "/images.png",
    "title": "Software Engineer",
    "category": "full-stack",
    "organization": "Google",
    "skills": [
      "professionall in programming language (like Python,Java,c++,javascript)",
      "knowledge of Data structures & Algorithms",
      "Understading the OOPs concept and Design Pattern",
      "Experience in databases like Sql,NoSql",
      "Familier with version conrol (like Git,Git Hub/Git Lab)",
      "Knowledge of software development methodologies (like Agile,Scrum)",
      "Ability to use IDEs ans developement tools efficiently",
      "Understanding of APIs,web development (HTML,CSS,Java Script,frameworks)",
      "Basic Knowledge of cloud computing (AWS,Azure,GCP)",
      "Understanding of testing & debugging techniques"
    ],
  "tag": "Full-time",
    "location": "Bangalore, India",
    "salary": "₹8,00,000 - ₹25,00,000",
    "duration": "6 months",
    "startDate": "Sep 24, 2025",
    "timePerWeek": "7-10 hours",
    "mode": "Instructor-paced",
    "credential": "Certificate or Badge",
    "description": "Software Engineers design, develop, and maintain software systems.",
    "about": "As a Software Engineer at Google, you'll design, develop, test, and deploy software solutions that impact billions of users worldwide. You'll work on cutting-edge technologies, collaborate with cross-functional teams including product managers, designers, and other engineers, and contribute to large-scale distributed systems. The role requires strong problem-solving skills, proficiency in data structures and algorithms, and the ability to write clean, maintainable code. You'll participate in code reviews, mentor junior engineers, and continuously learn new technologies to stay ahead in the fast-paced tech landscape.",
    "responsibilites": [
      "Design and implement scalable software solutions using modern programming languages",
      "Write clean, efficient, and well-documented code following best practices",
      "Participate in code reviews and provide constructive feedback to peers",
      "Debug and troubleshoot complex issues in production systems",
      "Collaborate with product managers and designers to understand requirements",
      "Optimize application performance and ensure system reliability",
      "Contribute to technical documentation and knowledge sharing",
      "Stay updated with emerging technologies and industry trends",
      "Participate in on-call rotations to support production systems",
      "Mentor junior engineers and contribute to team growth"
    ],
    "curriculum": [
      "Master programming fundamentals in Python, Java, or C++ with focus on clean code",
      "Deep dive into Data Structures (arrays, trees, graphs, heaps) and Algorithms (sorting, searching, dynamic programming)",
      "Learn Object-Oriented Programming principles and design patterns (SOLID, Factory, Observer, Strategy)",
      "Understand database design and work with both SQL (PostgreSQL, MySQL) and NoSQL (MongoDB, Redis) databases",
      "Master version control with Git and collaborative workflows (branching, merging, pull requests)",
      "Study software development methodologies including Agile, Scrum, and DevOps practices",
      "Learn to use modern IDEs and development tools efficiently (VS Code, IntelliJ, debugging tools)",
      "Understand web development fundamentals: HTML, CSS, JavaScript, and popular frameworks (React, Angular)",
      "Gain hands-on experience with cloud platforms (AWS, Azure, or GCP) and containerization (Docker, Kubernetes)",
      "Master testing strategies including unit testing, integration testing, and test-driven development (TDD)",
      "Build a portfolio of 3-5 substantial projects showcasing full-stack capabilities",
      "Practice system design for scalable applications (load balancing, caching, microservices)",
      "Prepare for technical interviews with LeetCode, HackerRank, and mock interview platforms"
    ],
    "experienceLevel": "Mid-level",
    "openings": 6,
    "companyWebsite": "https://google.com",
    "applyUrl": "https://careers.google.com",
    "salaryMin": 800000,
    "salaryMax": 2500000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Flexible work hours",
      "Remote-friendly policy",
      "Learning budget",
      "Paid time off",
      "Performance bonus"
    ],
    "howto": [
      "Tailor your resume to highlight DSA, projects, and impact",
      "Share GitHub/portfolio links with notable repos",
      "Apply via the Google Careers portal",
      "Prepare for DSA + system design interviews"
    ]
  },
  {
    "id": 2,
    "logo": "/images.png",
    "title": "Full Stack Developer",
    "category": "full-stack",
    "organization": "TCS",
    "skills": [
      "JavaScript, Node.js, React, MongoDB",
      "REST API integration",
      "Cloud deployment",
      "Git and CI/CD"
    ],
  "tag": "Contract",
    "location": "Pune, India",
    "salary": "₹6,50,000 - ₹20,00,000",
    "duration": "8 months",
    "startDate": "Oct 10, 2025",
    "timePerWeek": "8 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Build complete web applications from frontend to backend.",
    "about": "As a Full Stack Developer at TCS, you'll be responsible for developing complete web applications, handling both client-side and server-side development. You'll work with modern JavaScript frameworks like React for frontend and Node.js for backend, creating seamless user experiences while ensuring robust server architecture. The role involves collaborating with business analysts, designers, and other developers to translate requirements into technical solutions. You'll manage databases, implement RESTful APIs, handle authentication and authorization, and deploy applications to cloud platforms. This position offers exposure to diverse projects across multiple industries.",
    "responsibilites": [
      "Develop responsive and interactive user interfaces using React.js and modern CSS frameworks",
      "Build and maintain RESTful APIs using Node.js and Express.js",
      "Design and implement database schemas using MongoDB and optimize queries",
      "Implement user authentication and authorization using JWT and OAuth",
      "Integrate third-party APIs and services into applications",
      "Write unit tests and integration tests to ensure code quality",
      "Implement CI/CD pipelines for automated testing and deployment",
      "Optimize application performance for speed and scalability",
      "Collaborate with cross-functional teams in Agile sprints",
      "Document technical specifications and maintain code repositories"
    ],
    "curriculum": [
      "Master HTML5, CSS3, and modern JavaScript (ES6+) fundamentals",
      "Learn React.js including hooks, context API, and state management with Redux",
      "Understand Node.js runtime and build RESTful APIs with Express.js",
      "Master MongoDB database operations, schema design, and Mongoose ODM",
      "Learn authentication strategies: JWT tokens, sessions, and OAuth 2.0",
      "Study frontend build tools: Webpack, Babel, and package managers (npm, yarn)",
      "Practice version control with Git and GitHub workflows",
      "Learn responsive design principles and CSS frameworks (Tailwind, Bootstrap)",
      "Understand cloud deployment on platforms like AWS, Heroku, or Vercel",
      "Master debugging techniques and browser DevTools",
      "Build 4-6 full-stack projects: e-commerce site, social media app, task manager, blog platform",
      "Learn basic DevOps: Docker containers, CI/CD with GitHub Actions or Jenkins",
      "Practice coding challenges and prepare for technical interviews"
    ],
    "experienceLevel": "Mid-level",
    "openings": 4,
    "companyWebsite": "https://www.tcs.com",
    "applyUrl": "https://www.tcs.com/careers",
    "salaryMin": 650000,
    "salaryMax": 2000000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Paid time off",
      "Provident fund",
      "Performance bonus"
    ],
    "howto": [
      "Review role requirements and match your projects",
      "Ensure MERN stack portfolio links are included",
      "Apply on TCS Careers",
      "Practice basics of system design"
    ]
  },
  {
    "id": 3,
    "logo": "/images.png",
    "title": "Web Application Engineer",
    "category": "full-stack",
    "organization": "Zoho",
    "skills": ["HTML, CSS, JavaScript", "Flask or Django", "SQL databases"],
  "tag": "Full-time",
    "location": "Chennai, India",
    "salary": "₹5,00,000 - ₹14,00,000",
    "duration": "6 months",
    "startDate": "Oct 15, 2025",
    "timePerWeek": "6-10 hours",
    "mode": "Instructor-paced",
    "credential": "Badge",
    "description": "Design, develop, and test scalable web applications.",
    "about": "As a Web Application Engineer at Zoho, you'll design and develop scalable web applications using both frontend and backend technologies. This entry-level position is perfect for recent graduates who want to work on enterprise software products used by millions of businesses worldwide. You'll work with Python frameworks like Flask or Django for backend development and modern HTML/CSS/JavaScript for frontend. The role involves understanding business requirements, translating them into technical specifications, writing clean code, and collaborating with senior developers. Zoho offers a supportive learning environment where you'll gain exposure to the full software development lifecycle.",
    "responsibilites": [
      "Develop web applications using Flask or Django frameworks",
      "Create responsive user interfaces with HTML5, CSS3, and JavaScript",
      "Design and implement database schemas using MySQL or PostgreSQL",
      "Write clean, maintainable, and well-documented code",
      "Participate in code reviews and learn from senior developers",
      "Debug and fix issues reported by QA team or users",
      "Integrate frontend components with backend APIs",
      "Write unit tests and perform basic testing of features",
      "Collaborate with designers to implement UI/UX designs",
      "Contribute to technical documentation and user guides"
    ],
    "curriculum": [
      "Learn HTML5 semantic elements, CSS3 layouts (Flexbox, Grid), and responsive design",
      "Master JavaScript fundamentals: variables, functions, objects, DOM manipulation, and events",
      "Study Python programming: syntax, data structures, functions, and OOP concepts",
      "Learn Flask or Django framework basics: routing, templates, forms, and database integration",
      "Understand relational databases: SQL queries, joins, normalization, and MySQL/PostgreSQL",
      "Practice Git version control: commits, branches, merging, and collaboration workflows",
      "Learn RESTful API design principles and how to consume APIs",
      "Study web security basics: XSS, CSRF, SQL injection, and authentication",
      "Understand MVC architecture and separation of concerns",
      "Practice debugging with browser DevTools and Python debuggers",
      "Build 3-4 projects: personal blog, todo app, e-commerce product catalog, user management system",
      "Learn deployment basics: setting up servers, environment variables, and production configurations",
      "Prepare for interviews with coding challenges and system design basics"
    ],
    "experienceLevel": "Entry-level",
    "openings": 3,
    "companyWebsite": "https://www.zoho.com",
    "applyUrl": "https://www.zoho.com/careers/",
    "salaryMin": 500000,
    "salaryMax": 1400000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Team events",
      "Paid time off"
    ],
    "howto": [
      "Showcase web apps in portfolio",
      "Highlight Flask/Django projects",
      "Apply on Zoho Careers",
      "Prepare for web fundamentals interview"
    ]
  },
  {
    "id": 4,
    "logo": "/images.png",
    "title": "Frontend Developer",
    "category": "frontend",
    "organization": "Meta",
    "skills": [
      "Strong knowledge of HTML, CSS, JavaScript",
      "Experience with React or Vue.js",
      "Understanding of responsive design and accessibility"
    ],
  "tag": "Full-time",
    "location": "Remote",
    "salary": "₹6,00,000 - ₹15,00,000",
    "duration": "12 months",
    "startDate": "Oct 01, 2025",
    "timePerWeek": "8-12 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Create and optimize user-facing features.",
    "about": "As a Frontend Developer at Meta, you'll create exceptional user experiences for billions of users across Facebook, Instagram, WhatsApp, and other Meta products. You'll work with cutting-edge frontend technologies, primarily React and React Native, to build responsive, accessible, and performant interfaces. The role requires deep understanding of web standards, browser compatibility, and modern JavaScript. You'll collaborate closely with designers, product managers, and backend engineers to bring product visions to life. Meta values innovation, so you'll have opportunities to experiment with new technologies, contribute to open-source projects, and shape the future of social technology.",
    "responsibilites": [
      "Develop responsive and accessible user interfaces using React.js and modern JavaScript",
      "Implement pixel-perfect designs from Figma mockups with attention to detail",
      "Optimize application performance: lazy loading, code splitting, and bundle optimization",
      "Ensure cross-browser compatibility and handle edge cases gracefully",
      "Write semantic HTML and implement WCAG accessibility standards",
      "Collaborate with designers to refine user experiences and interactions",
      "Implement state management using Redux, Context API, or other solutions",
      "Write comprehensive unit and integration tests using Jest and React Testing Library",
      "Participate in design reviews and provide technical feedback",
      "Contribute to component libraries and design systems",
      "Debug and resolve frontend issues using browser DevTools",
      "Mentor junior developers and share best practices"
    ],
    "curriculum": [
      "Master HTML5 semantic elements and accessibility best practices (ARIA roles, labels)",
      "Deep dive into CSS3: Flexbox, Grid, animations, transitions, and modern layout techniques",
      "Learn JavaScript deeply: closures, promises, async/await, ES6+ features, and functional programming",
      "Study React.js comprehensively: components, hooks, lifecycle, context, and performance optimization",
      "Master state management with Redux or Zustand including middleware and async actions",
      "Learn TypeScript for type-safe code and better developer experience",
      "Understand build tools: Webpack, Vite, Babel, and module bundlers",
      "Study web performance optimization: Core Web Vitals, lighthouse scores, and profiling",
      "Learn responsive design patterns and mobile-first development",
      "Master CSS-in-JS solutions like styled-components or Emotion",
      "Understand browser APIs: localStorage, fetch, Web Workers, Service Workers",
      "Practice accessibility testing with screen readers and automated tools",
      "Build 5-7 projects: social media feed, dashboard, e-commerce site, chat application",
      "Learn Git advanced workflows: rebasing, cherry-picking, and collaborative development",
      "Prepare for frontend system design interviews: component architecture, state management, performance"
    ],
    "experienceLevel": "Mid-level",
    "openings": 8,
    "companyWebsite": "https://www.meta.com",
    "applyUrl": "https://www.meta.com/careers",
    "salaryMin": 600000,
    "salaryMax": 1500000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Remote-friendly",
      "Learning budget",
      "Wellness stipend",
      "Paid time off"
    ],
    "howto": [
      "Feature polished React work in portfolio",
      "Emphasize performance and accessibility",
      "Apply via Meta Careers",
      "Practice UI problem-solving"
    ]
  },
  {
    "id": 5,
    "logo": "/images.png",
    "title": "Frontend UI Engineer",
    "category": "frontend",
    "organization": "LinkedIn",
    "skills": ["React", "Next.js", "Figma to code", "Tailwind CSS"],
  "tag": "Contract",
    "location": "Hyderabad, India",
    "salary": "₹7,00,000 - ₹13,00,000",
    "duration": "9 months",
    "startDate": "Oct 10, 2025",
    "timePerWeek": "6 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Translate UI/UX design into code.",
    "about": "As a Frontend UI Engineer at LinkedIn, you'll bridge the gap between design and engineering, translating beautiful Figma designs into responsive, interactive web interfaces. You'll work with React and Next.js to build professional networking features used by millions of professionals worldwide. The role requires a keen eye for design details, strong CSS skills, and the ability to create smooth animations and transitions. You'll collaborate closely with designers and product teams to ensure the final implementation matches the design vision while maintaining performance and accessibility standards. This contract position offers flexibility and exposure to LinkedIn's design system and engineering practices.",
    "responsibilites": [
      "Convert Figma designs into pixel-perfect React components",
      "Build reusable UI components with Tailwind CSS and custom styling",
      "Implement smooth animations and micro-interactions using CSS and JavaScript",
      "Ensure responsive design across all device sizes and orientations",
      "Optimize images and assets for web performance",
      "Collaborate with UX designers to refine interactions and user flows",
      "Maintain and contribute to the component library and design system",
      "Write clean, maintainable CSS following BEM or similar methodologies",
      "Test components across different browsers and devices",
      "Document component APIs and usage guidelines"
    ],
    "curriculum": [
      "Master modern CSS: Grid, Flexbox, custom properties, and advanced selectors",
      "Learn Tailwind CSS utility-first approach and configuration",
      "Study React fundamentals and component composition patterns",
      "Learn Next.js for server-side rendering and static site generation",
      "Master CSS animations: keyframes, transitions, and transform properties",
      "Study JavaScript animations with libraries like Framer Motion or GSAP",
      "Learn Figma basics to understand design handoff and extract assets",
      "Understand design systems and component-driven development",
      "Practice responsive design with mobile-first approach",
      "Learn CSS preprocessors like SASS or PostCSS",
      "Study web fonts, typography, and visual hierarchy",
      "Build 4-5 UI-focused projects: landing pages, dashboards, portfolios, admin panels",
      "Learn performance optimization: critical CSS, lazy loading, and image optimization",
      "Prepare portfolio showcasing design-to-code implementations"
    ],
    "experienceLevel": "Mid-level",
    "openings": 5,
    "companyWebsite": "https://www.linkedin.com",
    "applyUrl": "https://careers.linkedin.com",
    "salaryMin": 700000,
    "salaryMax": 1300000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Remote option",
      "Paid time off"
    ],
    "howto": [
      "Attach UI case studies or CodeSandbox links",
      "Highlight React + Tailwind experience",
      "Apply via LinkedIn Careers",
      "Prepare for UI architecture discussions"
    ]
  },
  {
    "id": 6,
    "logo": "/images.png",
    "title": "Frontend Web Designer",
    "category": "frontend",
    "organization": "Canva",
    "skills": ["HTML5", "CSS3", "JavaScript basics", "Web animations"],
  "tag": "Internship",
    "location": "Bangalore, India",
    "salary": "₹3,00,000 - ₹6,00,000",
    "duration": "3 months",
    "startDate": "Sep 25, 2025",
    "timePerWeek": "5-6 hours",
    "mode": "Instructor-paced",
    "credential": "Badge",
    "description": "Support frontend team in UI development.",
    "about": "As a Frontend Web Designer Intern at Canva, you'll support the frontend engineering team in building beautiful, user-friendly web interfaces. This internship is designed for students or recent graduates looking to gain hands-on experience in web development. You'll work on real product features, learning from experienced engineers while contributing to Canva's design platform used by millions worldwide. The role focuses on implementing design mockups into functional web pages using HTML5, CSS3, and basic JavaScript. You'll receive mentorship, participate in code reviews, and develop both technical and professional skills in a creative, fast-paced environment.",
    "responsibilites": [
      "Implement design mockups into semantic HTML and CSS",
      "Create responsive layouts that work across devices",
      "Add basic interactivity using vanilla JavaScript",
      "Assist in testing web pages across different browsers",
      "Fix bugs and make minor improvements to existing pages",
      "Participate in team meetings and daily standups",
      "Learn from code reviews and apply feedback",
      "Document your work and share learnings with the team",
      "Collaborate with designers to understand requirements",
      "Contribute to the team's component library"
    ],
    "curriculum": [
      "Learn HTML5 fundamentals: semantic elements, forms, tables, and best practices",
      "Master CSS basics: selectors, box model, positioning, and display properties",
      "Study CSS Grid and Flexbox for modern layouts",
      "Learn JavaScript basics: variables, functions, DOM manipulation, and events",
      "Understand responsive design principles and media queries",
      "Practice CSS animations and transitions for engaging interfaces",
      "Learn Git basics: clone, commit, push, pull, and branching",
      "Study web accessibility fundamentals and semantic HTML",
      "Understand browser DevTools for debugging and testing",
      "Learn CSS naming conventions like BEM for maintainable code",
      "Build 3-4 beginner projects: portfolio site, landing page, blog layout, product card gallery",
      "Practice converting Figma/Sketch designs to code",
      "Prepare for internship interviews with HTML/CSS/JS coding challenges"
    ],
    "experienceLevel": "Internship",
    "openings": 2,
    "companyWebsite": "https://www.canva.com",
    "applyUrl": "https://www.canva.com/careers",
    "salaryMin": 300000,
    "salaryMax": 600000,
    "currency": "INR",
    "benefits": [
      "Mentorship",
      "Learning budget",
      "Team events",
      "Stipend"
    ],
    "howto": [
      "Share portfolio/Dribbble/Behance links",
      "Show responsive, accessible designs",
      "Apply via Canva Careers",
      "Brush up on semantic HTML/CSS"
    ]
  },
  {
    "id": 7,
    "logo": "/images.png",
    "title": "Backend Developer",
    "category": "backend",
    "organization": "Netflix",
    "skills": ["Node.js", "API development", "SQL/NoSQL", "Authentication"],
  "tag": "Contract",
    "location": "Hyderabad, India",
    "salary": "₹10,00,000 - ₹22,00,000",
    "duration": "9 months",
    "startDate": "Sep 15, 2025",
    "timePerWeek": "10 hours",
    "mode": "Instructor-paced",
    "credential": "Badge",
    "description": "Develop backend systems and APIs.",
    "about": "As a Backend Developer at Netflix, you'll build and maintain the server-side systems that power one of the world's largest streaming platforms. You'll design and implement scalable APIs, manage databases, and ensure system reliability for millions of concurrent users. The role involves working with Node.js, building microservices architecture, implementing authentication and authorization systems, and optimizing performance at scale. You'll collaborate with frontend teams, data engineers, and DevOps to deliver seamless streaming experiences. Netflix values innovation and experimentation, so you'll have opportunities to work on cutting-edge distributed systems and cloud technologies.",
    "responsibilites": [
      "Design and develop RESTful and GraphQL APIs using Node.js and Express",
      "Build microservices architecture for scalable and maintainable systems",
      "Implement authentication and authorization using JWT, OAuth, and session management",
      "Design and optimize database schemas for both SQL and NoSQL databases",
      "Implement caching strategies using Redis to improve performance",
      "Write comprehensive unit tests, integration tests, and API documentation",
      "Monitor application performance and optimize database queries",
      "Implement rate limiting, error handling, and security best practices",
      "Collaborate with frontend teams to define API contracts",
      "Participate in on-call rotations and troubleshoot production issues",
      "Deploy applications to AWS using Docker and Kubernetes",
      "Contribute to technical architecture discussions and code reviews"
    ],
    "curriculum": [
      "Master Node.js fundamentals: event loop, streams, buffers, and async patterns",
      "Learn Express.js framework: routing, middleware, error handling, and best practices",
      "Study database design: normalization, indexing, query optimization for PostgreSQL/MySQL",
      "Learn MongoDB and Mongoose for NoSQL database operations",
      "Master authentication strategies: JWT tokens, refresh tokens, OAuth 2.0, and session management",
      "Study RESTful API design principles and best practices",
      "Learn GraphQL: schema design, resolvers, and query optimization",
      "Understand message queues and async processing with RabbitMQ or Bull",
      "Master Redis for caching, session storage, and rate limiting",
      "Learn API security: HTTPS, CORS, input validation, and SQL injection prevention",
      "Study microservices architecture and inter-service communication",
      "Learn Docker for containerization and Kubernetes basics",
      "Understand AWS services: EC2, S3, RDS, Lambda, and API Gateway",
      "Practice building 4-5 backend projects: REST API, authentication system, real-time chat, payment integration",
      "Master testing with Jest, Mocha, and Supertest",
      "Learn monitoring and logging with tools like Winston, ELK stack",
      "Prepare for system design interviews: scalability, caching, load balancing"
    ],
    "experienceLevel": "Mid-level",
    "openings": 4,
    "companyWebsite": "https://www.netflix.com",
    "applyUrl": "https://jobs.netflix.com",
    "salaryMin": 1000000,
    "salaryMax": 2200000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Remote-friendly",
      "Learning budget",
      "Paid time off"
    ],
    "howto": [
      "Include API projects and database design",
      "Emphasize security and scalability",
      "Apply on Netflix Jobs",
      "Practice system design"
    ]
  },
  {
    "id": 8,
    "logo": "/images.png",
    "title": "Java Backend Developer",
    "category": "backend",
    "organization": "Infosys",
    "skills": ["Java", "Spring Boot", "MySQL", "Microservices"],
  "tag": "Full-time",
    "location": "Delhi, India",
    "salary": "₹8,00,000 - ₹18,00,000",
    "duration": "6 months",
    "startDate": "Oct 05, 2025",
    "timePerWeek": "8 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Build scalable backend apps in Java.",
    "about": "As a Java Backend Developer at Infosys, you'll work on enterprise-level applications using Java and Spring Boot framework. You'll develop microservices-based architectures for clients across banking, healthcare, retail, and other industries. The role involves designing RESTful APIs, implementing business logic, integrating with databases, and ensuring application security. You'll work in Agile teams, participate in daily standups, and contribute to all phases of the software development lifecycle. Infosys provides excellent learning opportunities including certifications, training programs, and exposure to diverse technologies and domains.",
    "responsibilites": [
      "Develop enterprise applications using Java and Spring Boot framework",
      "Design and implement microservices architecture with API gateway patterns",
      "Create RESTful APIs following industry best practices and standards",
      "Implement database operations using Spring Data JPA and Hibernate ORM",
      "Write SQL queries and optimize database performance with MySQL or PostgreSQL",
      "Implement security features: authentication, authorization, and data encryption",
      "Develop unit tests using JUnit and Mockito with high code coverage",
      "Integrate third-party services and APIs into applications",
      "Deploy applications using Docker containers and Kubernetes orchestration",
      "Participate in code reviews and maintain code quality standards",
      "Debug and resolve production issues with root cause analysis",
      "Document API specifications using Swagger/OpenAPI"
    ],
    "curriculum": [
      "Master Java fundamentals: OOP, collections, generics, streams, and lambda expressions",
      "Learn Spring Framework: dependency injection, Spring Core, and Spring MVC",
      "Deep dive into Spring Boot: auto-configuration, starters, and production-ready features",
      "Study Spring Data JPA and Hibernate for database operations and ORM mapping",
      "Learn relational database concepts: SQL, joins, indexes, transactions with MySQL",
      "Master RESTful web services: HTTP methods, status codes, and API design",
      "Study microservices architecture: service discovery, API gateway, circuit breaker patterns",
      "Learn Spring Security for authentication and authorization",
      "Understand Spring Cloud components: Config Server, Eureka, Feign, Zuul",
      "Master build tools: Maven or Gradle for dependency management and builds",
      "Learn Docker basics: creating images, containers, and docker-compose",
      "Study Kubernetes fundamentals: pods, deployments, services, and ingress",
      "Practice JUnit and Mockito for unit testing and test-driven development",
      "Build 4-5 projects: e-commerce backend, banking system, employee management, blog API",
      "Learn CI/CD with Jenkins or GitLab CI",
      "Study design patterns: Singleton, Factory, Strategy, Observer",
      "Prepare for Java interviews: core Java, Spring Boot, microservices, system design"
    ],
    "experienceLevel": "Mid-level",
    "openings": 5,
    "companyWebsite": "https://www.infosys.com",
    "applyUrl": "https://www.infosys.com/careers",
    "salaryMin": 800000,
    "salaryMax": 1800000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Paid time off",
      "Provident fund"
    ],
    "howto": [
      "Highlight Spring Boot microservices",
      "Show Docker/Kubernetes basics",
      "Apply via Infosys Careers",
      "Prepare for Java coding rounds"
    ]
  },
  {
    "id": 9,
    "logo": "/images.png",
    "title": "Python Backend Developer",
    "category": "backend",
    "organization": "Paytm",
    "skills": ["Python", "Flask", "REST APIs", "Redis"],
  "tag": "Full-time",
    "location": "Remote",
    "salary": "₹9,00,000 - ₹17,00,000",
    "duration": "7 months",
    "startDate": "Oct 20, 2025",
    "timePerWeek": "8 hours",
    "mode": "Instructor-paced",
    "credential": "Certificate",
    "description": "Develop and scale Python-based services.",
    "about": "As a Python Backend Developer at Paytm, you'll build and scale backend services for one of India's largest fintech platforms. You'll work with Flask framework to create efficient, lightweight web services handling millions of transactions daily. The role involves implementing payment processing systems, wallet services, and merchant APIs while ensuring high availability and security. You'll use Redis for caching and session management, implement queue systems for async processing, and work with databases to ensure data integrity. This position offers excellent exposure to fintech domain, payment systems, and large-scale distributed applications.",
    "responsibilites": [
      "Develop RESTful APIs using Flask framework with clean architecture",
      "Implement payment processing and wallet transaction services",
      "Design and optimize database schemas for financial transactions",
      "Implement Redis caching strategies for high-performance applications",
      "Build asynchronous task processing using Celery and message queues",
      "Ensure application security: encryption, secure APIs, and PCI compliance",
      "Write comprehensive unit tests and integration tests",
      "Optimize API response times and database query performance",
      "Implement rate limiting and fraud detection mechanisms",
      "Monitor application health using logging and alerting systems",
      "Deploy applications using Gunicorn, Nginx, and Docker",
      "Participate in code reviews and maintain high code quality"
    ],
    "curriculum": [
      "Master Python fundamentals: data structures, OOP, decorators, generators, and context managers",
      "Learn Flask framework: routing, blueprints, request/response handling, and extensions",
      "Study RESTful API design and implementation best practices",
      "Learn SQLAlchemy ORM for database operations and migrations",
      "Master PostgreSQL or MySQL: SQL queries, transactions, indexes, and optimization",
      "Study Redis: caching patterns, data structures, pub/sub, and session storage",
      "Learn Celery for asynchronous task processing and background jobs",
      "Understand message brokers: RabbitMQ or Redis as message queue",
      "Study authentication and authorization: JWT, OAuth, API keys",
      "Learn API security: input validation, SQL injection prevention, CORS, rate limiting",
      "Master Python testing: pytest, unittest, mocking, and test coverage",
      "Study Docker containerization and docker-compose for local development",
      "Learn Gunicorn and Nginx for production deployments",
      "Understand async Python: asyncio, aiohttp for concurrent operations",
      "Build 4-5 projects: payment API, e-wallet system, notification service, order management",
      "Learn monitoring and logging with tools like Sentry, ELK stack",
      "Study system design: caching strategies, database sharding, load balancing",
      "Prepare for Python backend interviews and fintech domain knowledge"
    ],
    "experienceLevel": "Mid-level",
    "openings": 3,
    "companyWebsite": "https://paytm.com",
    "applyUrl": "https://paytm.com/careers",
    "salaryMin": 900000,
    "salaryMax": 1700000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Flexible hours",
      "Learning budget",
      "Remote option"
    ],
    "howto": [
      "Showcase Flask + Redis experience",
      "Add links to production APIs",
      "Apply via Paytm Careers",
      "Brush up on async and caching"
    ]
  },
  {
    "id": 10,
    "logo": "/images.png",
    "title": "Data Scientist",
    "category": "data-science",
    "organization": "Amazon",
    "skills": ["Python", "Pandas", "ML basics", "SQL"],
  "tag": "Full-time",
    "location": "Chennai, India",
    "salary": "₹12,00,000 - ₹30,00,000",
    "duration": "6 months",
    "startDate": "Nov 01, 2025",
    "timePerWeek": "8 hours",
    "mode": "Instructor-paced",
    "credential": "Certificate",
    "description": "Analyze data and extract insights.",
    "about": "As a Data Scientist at Amazon, you'll transform vast amounts of data into actionable insights that drive business decisions across e-commerce, AWS, logistics, and other divisions. You'll work with large datasets, build predictive models, conduct A/B tests, and create data visualizations to communicate findings to stakeholders. The role requires strong statistical knowledge, proficiency in Python and SQL, and the ability to translate business problems into analytical solutions. You'll collaborate with product managers, engineers, and business leaders to identify opportunities for optimization, personalization, and growth. Amazon offers exposure to cutting-edge ML technologies and massive-scale data challenges.",
    "responsibilites": [
      "Analyze large datasets to identify trends, patterns, and business insights",
      "Build predictive models using machine learning algorithms",
      "Design and analyze A/B tests to measure product impact",
      "Create data visualizations and dashboards for stakeholders",
      "Perform statistical analysis and hypothesis testing",
      "Clean and preprocess data for analysis and modeling",
      "Collaborate with engineering teams to productionize models",
      "Present findings and recommendations to business leaders",
      "Monitor model performance and retrain as needed",
      "Write SQL queries to extract and manipulate data from databases",
      "Document methodologies and maintain reproducible analysis pipelines",
      "Stay updated with latest ML research and techniques"
    ],
    "curriculum": [
      "Master Python for data science: NumPy, Pandas, and data manipulation techniques",
      "Learn statistics: probability, distributions, hypothesis testing, and confidence intervals",
      "Study SQL deeply: joins, subqueries, window functions, and query optimization",
      "Master data visualization: Matplotlib, Seaborn, Plotly for compelling charts",
      "Learn machine learning fundamentals: supervised and unsupervised learning algorithms",
      "Study scikit-learn: classification, regression, clustering, and model evaluation",
      "Understand feature engineering and feature selection techniques",
      "Learn model evaluation metrics: accuracy, precision, recall, F1, ROC-AUC",
      "Study experiment design and A/B testing methodologies",
      "Master Jupyter notebooks for exploratory data analysis and reporting",
      "Learn data cleaning and preprocessing techniques for real-world messy data",
      "Study time series analysis and forecasting methods",
      "Understand deep learning basics with TensorFlow or PyTorch",
      "Learn big data tools: Spark basics for handling large datasets",
      "Build 5-6 projects: customer churn prediction, recommendation system, sales forecasting, sentiment analysis",
      "Practice Kaggle competitions to improve modeling skills",
      "Learn to communicate insights through storytelling with data",
      "Prepare for data science interviews: statistics, SQL, ML algorithms, case studies"
    ],
    "experienceLevel": "Mid-level",
    "openings": 6,
    "companyWebsite": "https://www.amazon.jobs",
    "applyUrl": "https://www.amazon.jobs/en/",
    "salaryMin": 1200000,
    "salaryMax": 3000000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "RSUs/ESOP (role dependent)",
      "Paid time off"
    ],
    "howto": [
      "Link to ML projects and notebooks",
      "Emphasize metrics and business impact",
      "Apply on Amazon Jobs",
      "Practice case studies"
    ]
  },
  {
    "id": 11,
    "logo": "/images.png",
    "title": "ML Engineer",
    "category": "data-science",
    "organization": "OpenAI",
    "skills": ["Python", "ML Ops", "TensorFlow", "FastAPI"],
  "tag": "Full-time",
    "location": "Remote",
    "salary": "₹15,00,000 - ₹35,00,000",
    "duration": "7 months",
    "startDate": "Oct 05, 2025",
    "timePerWeek": "10 hours",
    "mode": "Instructor-paced",
    "credential": "Certificate",
    "description": "Deploy ML pipelines in production.",
    "about": "As an ML Engineer at OpenAI, you'll bridge the gap between data science research and production systems, deploying machine learning models at scale. You'll build ML pipelines, optimize model performance, implement MLOps practices, and ensure models run reliably in production. The role involves working with cutting-edge AI technologies, large language models, and distributed systems. You'll collaborate with research scientists to productionize their models and with infrastructure teams to build scalable ML platforms. This senior-level position requires both strong software engineering skills and deep ML knowledge, offering opportunities to work on groundbreaking AI applications.",
    "responsibilites": [
      "Design and implement end-to-end ML pipelines from data ingestion to model deployment",
      "Build scalable model training infrastructure using distributed computing",
      "Deploy ML models as REST APIs using FastAPI or Flask",
      "Implement model monitoring, versioning, and A/B testing frameworks",
      "Optimize model inference performance for low-latency applications",
      "Develop data preprocessing and feature engineering pipelines",
      "Set up CI/CD pipelines for automated model training and deployment",
      "Implement MLOps best practices: experiment tracking, model registry, and reproducibility",
      "Collaborate with data scientists to productionize research models",
      "Monitor model performance and detect model drift in production",
      "Build tools and frameworks to accelerate ML development workflows",
      "Ensure model security, privacy, and ethical AI practices"
    ],
    "curriculum": [
      "Master Python and software engineering best practices: design patterns, testing, code quality",
      "Deep dive into machine learning: algorithms, model training, hyperparameter tuning",
      "Learn TensorFlow or PyTorch for deep learning model development",
      "Study MLOps principles and tools: MLflow, Weights & Biases, or Kubeflow",
      "Master FastAPI or Flask for building ML model APIs",
      "Learn Docker and Kubernetes for containerization and orchestration",
      "Study model deployment strategies: batch, real-time, edge deployment",
      "Understand distributed computing: Spark, Dask for large-scale data processing",
      "Learn model optimization: quantization, pruning, distillation for efficient inference",
      "Master CI/CD tools: GitHub Actions, Jenkins, or GitLab CI for ML pipelines",
      "Study cloud platforms: AWS SageMaker, GCP AI Platform, or Azure ML",
      "Learn model monitoring and observability tools",
      "Understand data versioning with DVC or similar tools",
      "Study model serving frameworks: TensorFlow Serving, TorchServe, ONNX Runtime",
      "Build 4-5 ML engineering projects: end-to-end ML pipeline, model API, retraining system, AB testing framework",
      "Learn feature stores and real-time feature engineering",
      "Study system design for ML systems: scalability, reliability, latency",
      "Prepare for ML engineering interviews: system design, ML concepts, coding"
    ],
    "experienceLevel": "Senior-level",
    "openings": 4,
    "companyWebsite": "https://openai.com",
    "applyUrl": "https://openai.com/careers",
    "salaryMin": 1500000,
    "salaryMax": 3500000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Remote-first policy",
      "Learning stipend",
      "Paid time off"
    ],
    "howto": [
      "Demonstrate ML in production experience",
      "Show infra knowledge (Docker, CI/CD)",
      "Apply via OpenAI Careers",
      "Prepare for systems + ML design"
    ]
  },
  {
    "id": 12,
    "logo": "/images.png",
    "title": "Data Analyst",
    "category": "data-science",
    "organization": "Swiggy",
    "skills": ["SQL", "Excel", "Power BI", "Python"],
  "tag": "Contract",
    "location": "Bangalore, India",
    "salary": "₹6,00,000 - ₹12,00,000",
    "duration": "6 months",
    "startDate": "Sep 28, 2025",
    "timePerWeek": "7 hours",
    "mode": "Self-paced",
    "credential": "Badge",
    "description": "Interpret and visualize company data.",
    "about": "As a Data Analyst at Swiggy, you'll turn raw data into meaningful insights that drive business decisions across delivery operations, customer engagement, and restaurant partnerships. You'll create dashboards, write SQL queries, analyze trends, and present findings to help optimize delivery times, improve customer satisfaction, and grow the business. This entry-level role is perfect for those starting their data career, offering hands-on experience with real business problems, exposure to large datasets, and opportunities to learn from experienced analysts. You'll work with tools like Excel, SQL, and Power BI to create impactful visualizations and reports.",
    "responsibilites": [
      "Write SQL queries to extract and analyze data from databases",
      "Create interactive dashboards and reports using Power BI or Tableau",
      "Perform exploratory data analysis to identify trends and patterns",
      "Clean and preprocess data to ensure accuracy and consistency",
      "Calculate key business metrics and track KPIs",
      "Conduct root cause analysis for business problems",
      "Collaborate with stakeholders to understand reporting requirements",
      "Present findings and recommendations to non-technical audiences",
      "Automate recurring reports and data pipelines",
      "Support A/B testing and experiment analysis",
      "Document analysis methodologies and data definitions",
      "Maintain data quality and identify data inconsistencies"
    ],
    "curriculum": [
      "Master Microsoft Excel: pivot tables, VLOOKUP, charts, and advanced formulas",
      "Learn SQL fundamentals: SELECT, JOIN, GROUP BY, WHERE, and aggregate functions",
      "Study advanced SQL: window functions, CTEs, subqueries, and query optimization",
      "Master Power BI: data modeling, DAX formulas, visualizations, and dashboard design",
      "Learn basic statistics: mean, median, mode, standard deviation, correlation",
      "Study data visualization principles: chart types, color theory, and storytelling",
      "Learn Python basics for data analysis: Pandas, NumPy for data manipulation",
      "Understand database concepts and data warehousing basics",
      "Practice business analysis: understanding metrics, KPIs, and business context",
      "Learn to identify and handle missing data, outliers, and data quality issues",
      "Study basic probability and hypothesis testing concepts",
      "Master presentation skills for communicating insights effectively",
      "Build 3-4 analysis projects: sales analysis, customer segmentation, operational metrics dashboard",
      "Learn Google Analytics for web analytics (bonus skill)",
      "Practice case studies and business problem-solving scenarios",
      "Prepare for data analyst interviews: SQL queries, Excel tasks, case studies"
    ],
    "experienceLevel": "Entry-level",
    "openings": 5,
    "companyWebsite": "https://careers.swiggy.com",
    "applyUrl": "https://careers.swiggy.com",
    "salaryMin": 600000,
    "salaryMax": 1200000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Team events",
      "Paid time off"
    ],
    "howto": [
      "Attach dashboards/portfolio links",
      "Demonstrate SQL proficiency",
      "Apply via Swiggy Careers",
      "Practice business case questions"
    ]
  },
  {
    "id": 13,
    "logo": "/images.png",
    "title": "UI/UX Designer",
    "category": "design",
    "organization": "Adobe",
    "skills": ["Figma", "Adobe XD", "Wireframing"],
  "tag": "Full-time",
    "location": "Mumbai, India",
    "salary": "₹5,00,000 - ₹14,00,000",
    "duration": "4 months",
    "startDate": "Oct 10, 2025",
    "timePerWeek": "6-8 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Design user-centric interfaces.",
    "about": "As a UI/UX Designer at Adobe, you'll create intuitive, beautiful user experiences for Creative Cloud products used by millions of designers, photographers, and creators worldwide. You'll conduct user research, create wireframes and prototypes, and collaborate with product managers and engineers to bring designs to life. The role requires a balance of aesthetic sensibility and user empathy, using tools like Figma and Adobe XD to craft pixel-perfect interfaces. You'll work on complex design challenges, contribute to Adobe's design system, and help shape the future of creative software. Adobe values innovation and provides a creative environment to experiment and grow your design skills.",
    "responsibilites": [
      "Conduct user research through interviews, surveys, and usability testing",
      "Create user personas, journey maps, and user flows",
      "Design wireframes and low-fidelity prototypes to explore concepts",
      "Develop high-fidelity UI designs with attention to visual hierarchy and aesthetics",
      "Build interactive prototypes using Figma or Adobe XD",
      "Collaborate with product managers to define product requirements",
      "Work with developers to ensure accurate implementation of designs",
      "Conduct usability testing and iterate based on user feedback",
      "Maintain design consistency using design systems and component libraries",
      "Present design concepts and rationale to stakeholders",
      "Ensure designs meet accessibility standards (WCAG)",
      "Stay updated with design trends and emerging UX patterns"
    ],
    "curriculum": [
      "Learn UX design fundamentals: user research, personas, user flows, information architecture",
      "Master Figma: components, auto-layout, prototyping, design systems, and collaboration",
      "Study Adobe XD for wireframing and prototyping",
      "Learn visual design principles: typography, color theory, spacing, visual hierarchy",
      "Understand interaction design: micro-interactions, animations, transitions",
      "Study accessibility guidelines: WCAG standards, screen reader compatibility, inclusive design",
      "Learn user research methods: interviews, surveys, card sorting, tree testing",
      "Master prototyping: creating clickable prototypes for user testing",
      "Study usability testing: planning tests, moderating sessions, analyzing results",
      "Learn design systems: creating and maintaining component libraries",
      "Understand responsive design principles for multi-device experiences",
      "Study mobile UI patterns for iOS and Android platforms",
      "Learn basic HTML/CSS to understand implementation constraints",
      "Build 5-7 design projects: mobile app, web application, dashboard, design system",
      "Create a strong portfolio showcasing your design process and thinking",
      "Practice design critiques and presenting your work",
      "Prepare for design interviews: portfolio reviews, whiteboarding exercises, case studies"
    ],
    "experienceLevel": "Mid-level",
    "openings": 3,
    "companyWebsite": "https://www.adobe.com",
    "applyUrl": "https://www.adobe.com/careers.html",
    "salaryMin": 500000,
    "salaryMax": 1400000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Wellness stipend",
      "Paid time off"
    ],
    "howto": [
      "Share portfolio with case studies",
      "Demonstrate user research depth",
      "Apply via Adobe Careers",
      "Prepare for whiteboarding exercises"
    ]
  },
  {
    "id": 14,
    "logo": "/images.png",
    "title": "Product Designer",
    "category": "design",
    "organization": "Spotify",
    "skills": ["User research", "Design thinking", "Prototyping"],
  "tag": "Full-time",
    "location": "Remote",
    "salary": "₹8,00,000 - ₹18,00,000",
    "duration": "6 months",
    "startDate": "Oct 18, 2025",
    "timePerWeek": "8 hours",
    "mode": "Instructor-paced",
    "credential": "Certificate",
    "description": "Design seamless product experiences.",
    "about": "As a Product Designer at Spotify, you'll shape the music streaming experience for over 500 million users worldwide. You'll own end-to-end product design from research to final implementation, balancing user needs with business goals. The role goes beyond UI design to include strategic thinking about product direction, conducting user research to understand listening behaviors, and collaborating closely with product managers, engineers, and data scientists. You'll work on features for music discovery, playlists, social sharing, and personalization. Spotify values data-driven design decisions and encourages experimentation, offering a creative environment where your work directly impacts how people experience music.",
    "responsibilites": [
      "Lead end-to-end product design from concept to launch",
      "Conduct qualitative and quantitative user research",
      "Create user personas, journey maps, and empathy maps",
      "Design wireframes, mockups, and high-fidelity prototypes",
      "Collaborate with product managers to define product strategy and roadmap",
      "Work with data analysts to measure design impact through metrics",
      "Facilitate design workshops and ideation sessions",
      "Create and maintain design documentation and specifications",
      "Conduct usability testing and A/B tests to validate designs",
      "Contribute to Spotify's design system and component library",
      "Present design rationale and storytelling to leadership",
      "Mentor junior designers and promote design thinking across the organization"
    ],
    "curriculum": [
      "Master design thinking methodology: empathize, define, ideate, prototype, test",
      "Learn advanced user research: contextual inquiry, diary studies, ethnographic research",
      "Study product strategy: OKRs, roadmapping, feature prioritization",
      "Master Figma advanced features: variants, design systems, collaborative design",
      "Learn UX metrics: task success rate, time on task, NPS, retention metrics",
      "Study behavioral psychology and user psychology principles",
      "Understand business models and how design impacts business goals",
      "Learn data analysis basics to interpret user behavior data",
      "Study Jobs-to-be-Done framework for understanding user motivations",
      "Master storytelling and presentation skills for stakeholder communication",
      "Learn interaction design patterns for web and mobile platforms",
      "Study information architecture and navigation design",
      "Understand technical constraints and collaborate effectively with engineers",
      "Learn design systems architecture and component API design",
      "Build 4-6 product design projects: mobile app redesign, new feature design, design system",
      "Practice product thinking through case studies and design challenges",
      "Create portfolio showcasing strategic thinking and end-to-end design process",
      "Prepare for product design interviews: portfolio critique, whiteboarding, product sense"
    ],
    "experienceLevel": "Mid-level",
    "openings": 4,
    "companyWebsite": "https://www.spotify.com",
    "applyUrl": "https://www.spotifyjobs.com",
    "salaryMin": 800000,
    "salaryMax": 1800000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Remote-friendly",
      "Learning budget",
      "Wellness stipend",
      "Paid time off"
    ],
    "howto": [
      "Show end-to-end product thinking",
      "Highlight impact using UX metrics",
      "Apply via Spotify Jobs",
      "Prepare for product critique"
    ]
  },
  {
    "id": 15,
    "logo": "/images.png",
    "title": "Graphic Designer",
    "category": "design",
    "organization": "Byju's",
    "skills": ["Photoshop", "Illustrator", "Creativity", "Branding"],
  "tag": "Contract",
    "location": "Delhi, India",
    "salary": "₹4,00,000 - ₹10,00,000",
    "duration": "3 months",
    "startDate": "Sep 20, 2025",
    "timePerWeek": "5 hours",
    "mode": "Self-paced",
    "credential": "Certificate",
    "description": "Create marketing and UI assets.",
    "about": "As a Graphic Designer at Byju's, you'll create compelling visual assets for India's largest ed-tech platform, supporting marketing campaigns, product interfaces, and educational content. This entry-level contract role involves designing social media graphics, marketing collaterals, UI elements, and brand materials that engage students and parents. You'll work with Adobe Creative Suite, collaborate with marketing and product teams, and help maintain visual consistency across all touchpoints. The role offers excellent exposure to fast-paced startup environment, diverse design challenges, and opportunities to build a strong portfolio while contributing to educational transformation in India.",
    "responsibilites": [
      "Design marketing assets for social media, email campaigns, and advertisements",
      "Create UI elements and icons for web and mobile applications",
      "Design presentations, infographics, and educational content",
      "Develop brand materials maintaining visual consistency with brand guidelines",
      "Collaborate with marketing team on campaign creative concepts",
      "Design print materials: brochures, posters, and promotional items",
      "Edit and retouch images for various marketing channels",
      "Create illustrations and custom graphics as needed",
      "Prepare files for print and digital publication",
      "Manage multiple projects and meet tight deadlines",
      "Incorporate feedback from stakeholders and iterate on designs",
      "Organize and maintain digital asset library"
    ],
    "curriculum": [
      "Master Adobe Photoshop: layers, masks, selections, retouching, and photo manipulation",
      "Learn Adobe Illustrator: vector graphics, pen tool, typography, and logo design",
      "Study graphic design principles: layout, composition, balance, contrast, alignment",
      "Learn color theory: color psychology, harmony, schemes, and brand colors",
      "Master typography: font pairing, hierarchy, readability, and type anatomy",
      "Study branding fundamentals: logo design, brand identity, style guides",
      "Learn print design: CMYK vs RGB, bleed, resolution, file formats",
      "Understand digital design: web graphics, social media formats, responsive assets",
      "Study layout design: grid systems, whitespace, visual flow",
      "Learn basic animation principles for motion graphics (Adobe After Effects basics)",
      "Practice creating mockups and presenting design concepts",
      "Study current design trends while maintaining timeless principles",
      "Learn design for different platforms: Instagram, Facebook, LinkedIn, YouTube",
      "Build portfolio with 8-10 diverse projects: brand identity, social media campaign, poster series, UI elements",
      "Practice receiving and incorporating constructive criticism",
      "Learn basic photography and image composition",
      "Prepare for design interviews: portfolio presentation, design challenges, tool proficiency tests"
    ],
    "experienceLevel": "Entry-level",
    "openings": 3,
    "companyWebsite": "https://byjus.com",
    "applyUrl": "https://byjus.com/careers/",
    "salaryMin": 400000,
    "salaryMax": 1000000,
    "currency": "INR",
    "benefits": [
      "Health insurance",
      "Learning budget",
      "Team events",
      "Paid time off"
    ],
    "howto": [
      "Attach portfolio (Dribbble/Behance)",
      "Show versatility across formats",
      "Apply via Byju's Careers",
      "Prepare for design challenge"
    ]
  }
]
